app/controllers/documents_controller.rb

SELECT * FROM `documents`
---
  def index
    @documents = Document.all

SELECT * FROM `documents` WHERE (`documents`.`id` = 1)
---
  def show
    @document = Document.find(params[:id])

SELECT * FROM `tickets` WHERE (`tickets`.`id` = 1)
INSERT INTO `documents` (`doc_content_type`, `doc_description`, `created_at`, `updated_at`, `ticket_id`, `doc_updated_at`, `doc_file_name`, `doc_file_size`) VALUES('application/pdf', 'UI issue', '2010-06-21 19:10:27', '2010-06-21 19:10:27', NULL, '2010-06-21 19:10:27', 'examples.pdf', 194937)
---
  def create
    @document = Document.new(params[:document])
    @ticket = Ticket.find(params[:ticket_id])
    @document.ticket = @ticket
    respond_to do |format|
      if @document.save

SELECT * FROM `documents` WHERE (`documents`.`id` = 1)
---
  def update
    @document = Document.find(params[:id])

SELECT * FROM `documents` WHERE (`documents`.`id` = 8)
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 1)
DELETE FROM `documents` WHERE `id` = 8
---
  def destroy
    @document = Document.find(params[:id])
    @ticket = Ticket.find(params[:ticket_id])
    @document.destroy