app/controllers/home_controller.rb

  def index
    if logged_in?
      @tickets = Ticket.all
---
SELECT * FROM `tickets`