app/controllers/tickets_controller.rb

  def index
    @tickets = Ticket.all
---
SELECT * FROM `tickets`

  def show
    @ticket = Ticket.find(params[:id])
---
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 1)

  def new
    @ticket = Ticket.new
    @users = User.find(:all)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def edit
    @ticket = Ticket.find(params[:id])
---
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 1)

  def create
    @ticket = Ticket.new(params[:ticket])
    @ticket.reporter = current_user
    @ticket.assignee = User.find(params[:ticket][:assigned_to])

    respond_to do |format|
      if @ticket.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
INSERT INTO `tickets` (`assigned_to`, `created_at`, `title`, `desciption`, `updated_at`, `priority`, `reported_by`) VALUES(NULL, '2010-06-15 19:08:24', 'New Ticket', 'This ticket is for testing..', '2010-06-15 19:08:24', 0, 1)