app/controllers/timelines_controller.rb

SELECT * FROM `timelines`
---
  def index
    @timelines = Timeline.all

SELECT * FROM `tickets` WHERE (`tickets`.`id` = 1)
INSERT INTO `timelines` (`created_at`, `updated_at`, `ticket_id`, `description`, `hours_spent`, `started_on`) VALUES('2010-06-22 18:12:57', '2010-06-22 18:12:57', 1, 'First Description', 8, '2010-06-22 18:11:00')
---
  def create
    @timeline = Timeline.new(params[:timeline])
    @ticket = Ticket.find(params[:ticket_id])
    @timeline.ticket = @ticket

    respond_to do |format|
      if @timeline.save