app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `remember_token`, `login`, `email`) VALUES('', 'cf8b67c5cc9cd9422502ba396a80bd9db106be74', '2010-06-14 22:00:55', NULL, 'a2e5cddabd7d08281eaa99ac9259b94ecf2a1b36', NULL, '2010-06-14 22:00:55', '23969790d428063670ad6ec51d1ae92c96d13637', NULL, 'gsohoni', 'gsohoni@gmail.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

SELECT * FROM `users` WHERE (`users`.`activation_code` = '23969790d428063670ad6ec51d1ae92c96d13637') LIMIT 1
---
  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?